/*******************************************************
 * Copyright (C) 2020-2021 Alexander Chervony <alexander.chervony@gmail.com>
 * This file is part of CoOp project. It can not be copied and/or distributed
 * without the express permission of Alexander Chervony.
*******************************************************/

namespace CoOp.Domain.Tests.Data
{
    public static partial class TestData
    {
        public static string[] Middlenames =
            {"Александрович","Алексеевич","Анатольевич","Андреевич","Антонович","Аркадьевич","Арсеньевич","Артемович","Афанасьевич","Богданович","Борисович","Вадимович","Валентинович","Валериевич","Васильевич","Викторович","Витальевич","Владимирович","Всеволодович","Вячеславович","Гаврилович","Геннадиевич","Георгиевич","Глебович","Григорьевич","Давыдович","Данилович","Денисович","Дмитриевич","Евгеньевич","Егорович","Емельянович","Ефимович","Иванович","Игоревич","Ильич","Иосифович","Кириллович","Константинович","Корнеевич","Леонидович","Львович","Макарович","Максимович","Маркович","Матвеевич","Митрофанович","Михайлович","Назарович","Наумович","Николаевич","Олегович","Павлович","Петрович","Платонович","Робертович","Родионович","Романович","Савельевич","Семенович","Сергеевич","Станиславович","Степанович","Тарасович","Тимофеевич","Тихонович","Федорович","Феликсович","Филиппович","Эдуардович","Юрьевич","Яковлевич","Ярославович"};
    }
}